/* Удаление процедуры обновления срезов по Химанализу */

DROP PROCEDURE R_HMZ_JOURNALS

--

/* Удаление процедуры обновления срезов Дренажи осн. 1го ряда */

DROP PROCEDURE R_HMZ_JOURNALS_1

--

/* Удаление процедуры обновления срезов Дренажи осн. 2го ряда */

DROP PROCEDURE R_HMZ_JOURNALS_2

--

/* Удаление процедуры обновления срезов Веерные пьезометры */

DROP PROCEDURE R_HMZ_JOURNALS_3

--

/* Удаление процедуры обновления срезов Дренажи бетона и швы */

DROP PROCEDURE R_HMZ_JOURNALS_4

--

/* Удаление процедуры обновления срезов Верхний бъеф */

DROP PROCEDURE R_HMZ_JOURNALS_5

--

/* Фиксация изменений БД */

COMMIT