/* Удаление процедуры обновления срезов по Фильтрации */

DROP PROCEDURE R_FLT_JOURNALS

--

/* Удаление процедуры обновления срезов Через бетон НГ плотины */

DROP PROCEDURE R_FLT_JOURNALS_1

--

/* Удаление процедуры обновления срезов Через швы НГ плотины */

DROP PROCEDURE R_FLT_JOURNALS_2

--

/* Удаление процедуры обновления срезов Дренажа осн. плотины 1 ряда */

DROP PROCEDURE R_FLT_JOURNALS_3

--

/* Удаление процедуры обновления срезов Через агрегатные швы */

DROP PROCEDURE R_FLT_JOURNALS_4

--

/* Удаление процедуры обновления срезов Автоном. источн. и водосливы */

DROP PROCEDURE R_FLT_JOURNALS_5

--

/* Удаление процедуры обновления срезов Дренажа осн. плотины 2 ряда */

DROP PROCEDURE R_FLT_JOURNALS_6

--

/* Фиксация изменений БД */

COMMIT